# Задание 3. Розыгрыш призов
# Дан список участников:
# participants = [
#     "Анна",
#     "Иван",
#     "Мария",
#     "Олег",
#     "Сергей",
#     "Елена",
#     "Павел",
#     "Ирина"]
# С помощью `random` случайным образом выберите трёх разных победителей.
# Один человек не должен выиграть дважды.
import random

participants = [
    "Анна",
    "Иван",
    "Мария",
    "Олег",
    "Сергей",
    "Елена",
    "Павел",
    "Ирина"]
winners = random.choices(participants, k=3)
print('Победители:', *winners, sep='\n')
