# Задание 3. Шкала цен
# Средствами NumPy сформируйте массив цен:
# 50, 100, 150, 200, 250, 300
# Затем сформируйте `6` равномерно распределённых коэффициентов от: 0 до:0.25
# Не перечисляйте значения массивов вручную и не используйте обычный `range()`.
# Рассчитайте новые цены:
# цена * (1 + коэффициент)
# Все вычисления выполните векторными операциями NumPy.
import numpy as np

prices = np.arange(50, 301, 50)
print(f'Цены: {prices}')
coeff = np.linspace(0, 0.25, 6)
print(f'Коэффициенты: {coeff}')
new_prices = prices * (1 + coeff)
print(f'Новые цены: {new_prices}')
