# Задание 8 ⭐. Трёхмерный склад
# Средствами NumPy сформируйте последовательность чисел:
# 1, 2, 3, ..., 24
# Не записывайте числа вручную.
# Преобразуйте полученные данные в трёхмерный массив:
# 2 × 3 × 4
# Считайте, что:
# * первое измерение — склады;
# * второе — стеллажи;
# * третье — товары.
# Не используя циклы:
# 1. получите второй склад;
# 2. посчитайте сумму каждого его стеллажа;
# 3. найдите максимальные значения каждого столбца первого склада;
# 4. получите из второго склада второй и третий столбцы;
# 5. создайте независимую копию этого фрагмента;
# 6. увеличьте значения копии в `10` раз.
# После изменения копии исходный трёхмерный массив должен остаться без изменений.
import numpy as np

table = np.arange(1, 25).reshape(2, 3, 4)
warehouse2 = table[1]
print(f'Второй склад:\n{warehouse2}')
shelf_sums = warehouse2.sum(axis=1)
print(f'Суммы стеллажей:\n{shelf_sums}')
warehouse1 = table[0]
col_max = warehouse1.max(axis=0)
print(f'Максимумы первого склада:\n{col_max}')
fragment_copy = table[1, :, 1:3].copy()
fragment_copy *= 10
print(f'Изменённая копия:\n {fragment_copy}')
