# Задание 5. Выбор данных из таблицы
# Дана матрица:
# data = np.array([
#     [11, 12, 13, 14, 15],
#     [21, 22, 23, 24, 25],
#     [31, 32, 33, 34, 35],
#     [41, 42, 43, 44, 45]
# ])
# Не создавая новые массивы вручную, получите из исходной матрицы:
# 1. элементы со второго по четвёртый столбец первых трёх строк;
# 2. каждый второй столбец всей таблицы;
# 3. строки таблицы в обратном порядке.
# Используйте индексацию и срезы NumPy.

import numpy as np

data = np.array([
    [11, 12, 13, 14, 15],
    [21, 22, 23, 24, 25],
    [31, 32, 33, 34, 35],
    [41, 42, 43, 44, 45]
])
print('Фрагмент:')
print(data[:3, 1:4])
print('Каждый второй столбец:')
print(data[:, ::2])
print('Строки в обратном порядке:')
print(data[::-1])
