# Задание 6. Выручка по товарам
# Даны два массива:
# prices = np.array([120, 80, 250, 150])
# quantity = np.array([3, 5, 2, 4])
# Первый содержит цены товаров.
# Второй — количество проданных единиц.
# Средствами NumPy получите выручку по каждому товару.
# После этого определите:
# * общую выручку;
# * максимальную выручку;
# * минимальную выручку.
# не перебирайте массив циклом.
import numpy as np

prices = np.array([120, 80, 250, 150])
quantity = np.array([3, 5, 2, 4])
result = prices * quantity
print('Выручка:')
print(result)
print(f'Общая выручка: {result.sum()}')
print(f'Максимум: {result.max()}')
print(f'Минимум: {result.min()}')
