# Задание 4. Расширение массива
# Дан массив:
# data = np.array([5, 10, 15])
# Средствами NumPy получите массив из `12` элементов:
# [ 5 10 15  5 10 15  5 10 15  5 10 15]
# Не записывайте эти `12` элементов вручную.
# После этого преобразуйте данные в таблицу:
# 3 × 4
# Выведите:
# * всю таблицу;
# * вторую строку;
# * третий столбец;
# * последний элемент.
# Для получения отдельных частей массива используйте индексацию NumPy.
import numpy as np

data = np.array([5, 10, 15])
new_data = np.tile(data, 4)
result = new_data.reshape(3, 4)
print(result)
print("Вторая строка:")
print(result[1])
print("Третий столбец:")
print(result[:, 2])
print("Последний элемент:")
print(result[-1, -1])
