# Задание 7 ⭐. Анализ недели
# Дан одномерный массив:
# data = np.array([
#     12, 15, 9, 14,
#     20, 18, 22, 16,
#     7, 11, 10, 9,
#     25, 20, 18, 22,
#     14, 13, 17, 15,
#     30, 28, 26, 24,
#     9, 12, 8, 11
# ])
# Это данные за `7` дней.
# Для каждого дня записано по `4` значения.
# Средствами NumPy:
# 1. представьте данные в виде таблицы `7 × 4`;
# 2. посчитайте сумму каждого дня;
# 3. посчитайте сумму каждой из четырёх позиций;
# 4. найдите максимальное значение каждого дня;
# 5. найдите минимальное значение каждой позиции;
# 6. получите первые два значения последних трёх дней.
import numpy as np

data = np.array([
    12, 15, 9, 14,
    20, 18, 22, 16,
    7, 11, 10, 9,
    25, 20, 18, 22,
    14, 13, 17, 15,
    30, 28, 26, 24,
    9, 12, 8, 11
])
table = data.reshape(7, 4)
print(table)
print(f'Суммы по дням:\n {table.sum(axis=1)}')
print(f'Суммы столбцов:\n {table.sum(axis=0)}')
print(f'Максимумы по дням:\n {table.max(axis=1)}')
print(f'Максимумы по дням:\n {table.min(axis=0)}')
print(f'Последние три дня, первые два значения:\n {table[-3:, :2]}')
